package src.main.java.HomeWorks.Homework1;

/*
 Задача 1. Составить программу вывода на экран в одну строку четырех
 любых чисел с тремя пробелами между ними.
 */
public class Task1 {
    public static void main(String[] args) {
        int a = 1;
        int b = 2;
        int c = 3;
        int d = 4;
        System.out.println(a + " " + b + " " + c + " " + d);
    }
}
